Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject class represents the tolerated object.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject.#ctor(System.Object,Tekla.Common.Geometry.Vector3)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject class.
target: The target.
hitPoint: The hit point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject.#ctor(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject class.
toleratedObject: The tolerated object.